In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('insurance.csv')

In [3]:
data.head()

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [4]:
data.tail()

      age     sex   bmi  children smoker     region  expenses
1333   50    male  31.0         3     no  northwest  10600.55
1334   18  female  31.9         0     no  northeast   2205.98
1335   18  female  36.9         0     no  southeast   1629.83
1336   21  female  25.8         0     no  southwest   2007.95
1337   61  female  29.1         0    yes  northwest  29141.36

In [5]:
data.shape

(1338, 7)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   expenses  1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [8]:
data.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
expenses    0
dtype: int64

In [11]:
data.describe(include='all')

,age,sex,bmi,children,smoker,region,expenses
count,1338.000000,1338,1338.000000,1338.000000,1338,1338,1338.000000
unique,NaN,2,NaN,NaN,2,4,NaN
top,NaN,male,NaN,NaN,no,southeast,NaN
freq,NaN,676,NaN,NaN,1064,364,NaN
mean,39.207025,NaN,30.665471,1.094918,NaN,NaN,13270.422414
std,14.049960,NaN,6.098382,1.205493,NaN,NaN,12110.011240
min,18.000000,NaN,16.000000,0.000000,NaN,NaN,1121.870000
25%,27.000000,NaN,26.300000,0.000000,NaN,NaN,4740.287500
50%,39.000000,NaN,30.400000,1.000000,NaN,NaN,9382.030000
75%,51.000000,NaN,34.700000,2.000000,NaN,NaN,16639.915000
max,64.000000,NaN,53.100000,5.000000,NaN,NaN,63770.430000

In [13]:
data['sex'].unique()

array(['female', 'male'], dtype=object)

In [17]:
data['sex']=data['sex'].map({'female':0,'male':1})

In [18]:
data.head()

   age  sex   bmi  children smoker     region  expenses
0   19    0  27.9         0    yes  southwest  16884.92
1   18    1  33.8         1     no  southeast   1725.55
2   28    1  33.0         3     no  southeast   4449.46
3   33    1  22.7         0     no  northwest  21984.47
4   32    1  28.9         0     no  northwest   3866.86

In [19]:
data['smoker']=data['smoker'].map({'yes':0,'no':1})

In [20]:
data.head()

   age  sex   bmi  children  smoker     region  expenses
0   19    0  27.9         0       0  southwest  16884.92
1   18    1  33.8         1       1  southeast   1725.55
2   28    1  33.0         3       1  southeast   4449.46
3   33    1  22.7         0       1  northwest  21984.47
4   32    1  28.9         0       1  northwest   3866.86

In [21]:
data['region'].unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [22]:
data['region']=data['region'].map({'southwest':0, 'southeast':1, 'northwest':2, 'northeast':3})

In [23]:
data.head()

   age  sex   bmi  children  smoker  region  expenses
0   19    0  27.9         0       0       0  16884.92
1   18    1  33.8         1       1       1   1725.55
2   28    1  33.0         3       1       1   4449.46
3   33    1  22.7         0       1       2  21984.47
4   32    1  28.9         0       1       2   3866.86

In [25]:
data.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'expenses'], dtype='object')

In [28]:
X = data.drop(['expenses'],axis=1)
X.head()

   age  sex   bmi  children  smoker  region
0   19    0  27.9         0       0       0
1   18    1  33.8         1       1       1
2   28    1  33.0         3       1       1
3   33    1  22.7         0       1       2
4   32    1  28.9         0       1       2

In [30]:
Y=data['expenses']
Y.head()

0    16884.92
1     1725.55
2     4449.46
3    21984.47
4     3866.86
Name: expenses, dtype: float64

In [31]:
from sklearn.model_selection import train_test_split

In [36]:
X_train,X_test,Y_train,Y_test= train_test_split(X,Y,test_size=0.2,random_state=15)

In [37]:
X_train

      age  sex   bmi  children  smoker  region
1256   51    0  36.4         3       1       2
147    51    0  37.7         1       1       1
1042   20    1  30.7         0       0       3
889    57    1  33.6         1       1       2
650    49    0  42.7         2       1       1
...   ...  ...   ...       ...     ...     ...
1223   20    0  24.4         0       0       1
667    40    0  32.8         2       0       2
156    48    1  24.4         0       0       1
384    44    1  22.1         2       1       3
645    48    1  30.8         3       1       3

[1070 rows x 6 columns]

In [38]:
X_test

      age  sex   bmi  children  smoker  region
38     35    1  36.7         1       0       3
126    19    0  28.3         0       0       0
479    23    1  32.6         0       1       1
10     25    1  26.2         0       1       3
195    19    1  30.6         0       1       2
...   ...  ...   ...       ...     ...     ...
1059   32    1  33.8         1       1       2
303    28    0  33.0         2       1       1
335    64    1  34.5         0       1       0
792    22    0  23.2         0       1       3
1213   52    0  33.3         2       1       0

[268 rows x 6 columns]

In [39]:
from sklearn.linear_model import LinearRegression

In [40]:
from sklearn.svm import SVR
from sklearn.ensemble import RandomForestRegressor
from sklearn.ensemble import GradientBoostingRegressor

In [42]:
lr= LinearRegression()
lr.fit(X_train,Y_train)

LinearRegression()

In [43]:
svm= SVR()
svm.fit(X_train,Y_train)

SVR()

In [44]:
rfr = RandomForestRegressor()
rfr.fit(X_train,Y_train)

RandomForestRegressor()

In [45]:
gbr=  GradientBoostingRegressor()
gbr.fit(X_train,Y_train)

GradientBoostingRegressor()

In [46]:
y_pred1=lr.predict(X_test)
y_pred2=svm.predict(X_test)
y_pred3=rfr.predict(X_test)
y_pred4=gbr.predict(X_test)

In [48]:
df1=pd.DataFrame({'Actual':Y_test,'Linearregresion':y_pred1,'svm':y_pred2,'rfr':y_pred3,'gbr':y_pred4})
df1

        Actual  Linearregresion          svm         rfr           gbr
38    39774.28     33743.975875  9617.874345  43893.5061  43371.811314
126   17081.08     25029.691575  9544.304193  17981.7098  19200.920688
479    1824.29      4064.250318  9556.648656   3430.2300   3763.633111
10     2721.32      3171.122983  9562.541000   2609.4945   4382.477035
195    1639.56      2704.899495  9544.474285   1675.1760   2850.469100
...        ...              ...          ...         ...           ...
1059   4462.72      7793.583386  9598.211823   5963.3567   5883.571727
303    4349.46      6694.166874  9577.223527   6715.9443   7115.685832
335   13822.80     15100.719709  9779.030382  14108.2327  16309.010398
792    2731.91      1346.226389  9553.176110   3142.2158   3669.921574
1213  10806.84     12736.526253  9724.211866  14013.3706  13952.962917

[268 rows x 5 columns]

In [49]:
from sklearn import metrics

In [51]:
score1= metrics.r2_score(Y_test,y_pred1)
score2= metrics.r2_score(Y_test,y_pred2)
score3= metrics.r2_score(Y_test,y_pred3)
score4= metrics.r2_score(Y_test,y_pred4)
print(score1,score2,score3,score4)

0.7709384665253125 -0.04663777971639371 0.8497937639988613 0.8806333082291278

In [52]:
s1= metrics.mean_absolute_error(Y_test,y_pred1)
s2= metrics.mean_absolute_error(Y_test,y_pred2)
s3= metrics.mean_absolute_error(Y_test,y_pred3)
s4= metrics.mean_absolute_error(Y_test,y_pred4)
print(s1,s2,s3,s4)

3936.025880244364 7809.533857341407 2579.057671380596 2301.027710311721

In [54]:
gbr=GradientBoostingRegressor()
gbr.fit(X,Y)

GradientBoostingRegressor()

In [55]:
import joblib
joblib.dump(gbr,'model1')

['model1']

In [59]:
import pickle
pickle.dump(gbr,open('picklemodel.pkl','wb'))

In [60]:
pickled_model= pickle.load(open('picklemodel.pkl','rb'))